import { OptionTemplate } from '@components/templates/OptionTemplate';

export function Option() {
  return (
    <OptionTemplate
      title="컴포트 ||"
      price={690000}
      tags={['여름에 쓰기 좋아요☀️', '옵션값 뽑았어요👍', '편리해요☺️']}
      index={5}
      selectedCategory={1}
      selectedOption={1}
      optionDetails={[
        {
          title: '헤드업 디스플레이',
          description:
            '초음파 센서를 통해 뒷좌석에 남아있는 승객의 움직임을 감지하여 운전자에게 경고함으로써 부주의에 의한 유아 또는 반려 동물 등의 방치 사고를 예방하는 신기술입니다.',
        },
        {
          title: '헤드업 디스플레이',
          description:
            '초음파 센서를 통해 뒷좌석에 남아있는 승객의 움직임을 감지하여 운전자에게 경고함으로써 부주의에 의한 유아 또는 반려 동물 등의 방치 사고를 예방하는 신기술입니다.',
        },
        {
          title: '헤드업 디스플레이',
          description:
            '초음파 센서를 통해 뒷좌석에 남아있는 승객의 움직임을 감지하여 운전자에게 경고함으로써 부주의에 의한 유아 또는 반려 동물 등의 방치 사고를 예방하는 신기술입니다.',
        },
        {
          title: '헤드업 디스플레이',
          description:
            '초음파 센서를 통해 뒷좌석에 남아있는 승객의 움직임을 감지하여 운전자에게 경고함으로써 부주의에 의한 유아 또는 반려 동물 등의 방치 사고를 예방하는 신기술입니다.',
        },
        {
          title: '헤드업 디스플레이',
          description:
            '초음파 센서를 통해 뒷좌석에 남아있는 승객의 움직임을 감지하여 운전자에게 경고함으로써 부주의에 의한 유아 또는 반려 동물 등의 방치 사고를 예방하는 신기술입니다.',
        },
        {
          title: '헤드업 디스플레이',
          description:
            '초음파 센서를 통해 뒷좌석에 남아있는 승객의 움직임을 감지하여 운전자에게 경고함으로써 부주의에 의한 유아 또는 반려 동물 등의 방치 사고를 예방하는 신기술입니다.',
        },
      ]}
      selectOptionCardInfo={[
        {
          image: 'src/assets/leblanc.jpeg',
          title: '컴포트 2',
          price: 1090000,
          descriptions: [
            '전방 충돌방지 보조(교차 차량/추월시 대향차/측방 접근차)',
            '내비게이션 기반 스마트 크루즈 컨트롤(진출입로)',
            '고속도로 주행 보조 2',
          ],
        },
        {
          image: 'src/assets/leblanc.jpeg',
          title: '컴포트 2',
          price: 1090000,
          descriptions: [
            '전방 충돌방지 보조(교차 차량/추월시 대향차/측방 접근차)',
            '내비게이션 기반 스마트 크루즈 컨트롤(진출입로)',
            '고속도로 주행 보조 2',
          ],
        },
        {
          image: 'src/assets/leblanc.jpeg',
          title: '컴포트 2',
          price: 1090000,
          descriptions: [
            '전방 충돌방지 보조(교차 차량/추월시 대향차/측방 접근차)',
            '내비게이션 기반 스마트 크루즈 컨트롤(진출입로)',
            '고속도로 주행 보조 2',
          ],
        },
        {
          image: 'src/assets/leblanc.jpeg',
          title: '컴포트 2',
          price: 1090000,
          descriptions: [
            '전방 충돌방지 보조(교차 차량/추월시 대향차/측방 접근차)',
            '내비게이션 기반 스마트 크루즈 컨트롤(진출입로)',
            '고속도로 주행 보조 2',
          ],
        },
        {
          image: 'src/assets/leblanc.jpeg',
          title: '컴포트 2',
          price: 1090000,
          descriptions: [
            '전방 충돌방지 보조(교차 차량/추월시 대향차/측방 접근차)',
            '내비게이션 기반 스마트 크루즈 컨트롤(진출입로)',
            '고속도로 주행 보조 2',
          ],
        },
        {
          image: 'src/assets/leblanc.jpeg',
          title: '컴포트 2',
          price: 1090000,
          descriptions: [
            '전방 충돌방지 보조(교차 차량/추월시 대향차/측방 접근차)',
            '내비게이션 기반 스마트 크루즈 컨트롤(진출입로)',
            '고속도로 주행 보조 2',
          ],
        },
      ]}
      defaultOptionCardInfo={[
        {
          image: 'src/assets/leblanc.jpeg',
          text: 'ISG 시스템',
          subtext: '기본 포함',
          description:
            '신호 대기 상황이거나 정차 중일 때 차의 엔진을 일시 정지하여 연비를 향상시키고, 배출가스 발생을 억제하는 시스템입니다.',
        },
        {
          image: 'src/assets/leblanc.jpeg',
          text: 'ISG 시스템',
          subtext: '기본 포함',
          description:
            '신호 대기 상황이거나 정차 중일 때 차의 엔진을 일시 정지하여 연비를 향상시키고, 배출가스 발생을 억제하는 시스템입니다.',
        },
        {
          image: 'src/assets/leblanc.jpeg',
          text: 'ISG 시스템',
          subtext: '기본 포함',
          description:
            '신호 대기 상황이거나 정차 중일 때 차의 엔진을 일시 정지하여 연비를 향상시키고, 배출가스 발생을 억제하는 시스템입니다.',
        },
        {
          image: 'src/assets/leblanc.jpeg',
          text: 'ISG 시스템',
          subtext: '기본 포함',
          description:
            '신호 대기 상황이거나 정차 중일 때 차의 엔진을 일시 정지하여 연비를 향상시키고, 배출가스 발생을 억제하는 시스템입니다.',
        },
        {
          image: 'src/assets/leblanc.jpeg',
          text: 'ISG 시스템',
          subtext: '기본 포함',
          description:
            '신호 대기 상황이거나 정차 중일 때 차의 엔진을 일시 정지하여 연비를 향상시키고, 배출가스 발생을 억제하는 시스템입니다.',
        },
        {
          image: 'src/assets/leblanc.jpeg',
          text: 'ISG 시스템',
          subtext: '기본 포함',
          description:
            '신호 대기 상황이거나 정차 중일 때 차의 엔진을 일시 정지하여 연비를 향상시키고, 배출가스 발생을 억제하는 시스템입니다.',
        },
      ]}
      categories={['파워 트레인/성능', '지능형 안전 기술', '안전', '외관', '내장', '시트', '편의', '멀티미디어']}
    />
  );
}
